"use strict";
// === вариант вывода в консоль ====================================
// const total = 100;  // количество товаров на складе
// const ordered = 50;  // количество заказа
// let message;

// if (ordered >= total) {
//     message = "\"На складе недостаточно товаров\"";
// } else {
//     message = "\"Заказ оформлен, с вами свяжется менеджер\"";
// };
// console.log(message);

// === вариант с alert и ordered = 20 ===============================
// const total = 100; 
// const ordered = 20; 

// if (ordered >= total) {
//     alert('На складе недостаточно товаров!');
// } else {
//     alert('Заказ оформлен, с вами свяжется менеджер');
// };

// === вариант с alert и ordered = 80 ===============================
// const total = 100; 
// const ordered = 80; 

// if (ordered >= total) {
//     alert('На складе недостаточно товаров!');
// } else {
//     alert('Заказ оформлен, с вами свяжется менеджер');
// };

// === вариант с alert и ordered = 130 ===============================
// const total = 100;
// const ordered = 130;

// if (ordered >= total) {
//     alert('На складе недостаточно товаров!');
// } else {
//     alert('Заказ оформлен, с вами свяжется менеджер');
// };